; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v12 ?v4)
             (pred_2 ?v9 ?v10)
             (pred_10 ?v12 ?v10)
             (pred_1 ?v6 ?v12 )
	     (pred_6 ?v12)
             (pred_5 ?v8)
             (pred_11 ?v9)
             (pred_4 ?v10)
             (pred_9 ?v12)
             (pred_3 ?v9)
             (pred_12 ?v12)
             (pred_8 ))



(:action op_3
:parameters (?v5 ?v7 ?v3 ?v1)
:precondition (and (pred_5 ?v5) (pred_5 ?v7) (pred_11 ?v3) (pred_4 ?v1)
          (pred_7 ?v5 ?v7) (pred_2 ?v3 ?v1)
                   (pred_10 ?v7 ?v1) (pred_6 ?v5) 
                   (pred_9 ?v7) (pred_3 ?v3))
:effect (and  (pred_12 ?v7) (not (pred_9 ?v7))))


(:action op_5
:parameters (?v5 ?v11)
:precondition (and (pred_5 ?v5) (pred_5 ?v11)
               (pred_6 ?v5) (pred_7 ?v5 ?v11) (pred_12 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v5))))

(:action op_4
:parameters (?v5 ?v3)
:precondition (and (pred_5 ?v5) (pred_11 ?v3) 
                  (pred_6 ?v5) (pred_1 ?v3 ?v5) (pred_8 ))
:effect (and (pred_3 ?v3)
   (not (pred_1 ?v3 ?v5)) (not (pred_8 ))))


(:action op_1
:parameters (?v5 ?v13 ?v2)
:precondition (and (pred_5 ?v5) (pred_11 ?v13) (pred_11 ?v2)
                  (pred_6 ?v5) (pred_3 ?v2) (pred_1 ?v13 ?v5))
:effect (and (pred_3 ?v13) (pred_1 ?v2 ?v5)
        (not (pred_3 ?v2)) (not (pred_1 ?v13 ?v5))))

(:action op_2
:parameters (?v5 ?v3)
:precondition (and (pred_5 ?v5) (pred_11 ?v3) 
                  (pred_6 ?v5) (pred_3 ?v3))
:effect (and (pred_8 ) (pred_1 ?v3 ?v5) (not (pred_3 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_16 obj_14 obj_17 obj_02 obj_06 obj_04 obj_09 obj_03 obj_05 obj_13 obj_15 obj_20 obj_01 obj_18 obj_11 obj_19
    obj_08 obj_10
    obj_07 obj_12
    )

    (:init
       (pred_8)

       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_17)
       (pred_5 obj_02)
       (pred_5 obj_06)
       (pred_5 obj_04)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_05)
       (pred_5 obj_13)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_5 obj_01)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_19)
       (pred_4 obj_08)
       (pred_4 obj_10)
       (pred_11 obj_07)
       (pred_11 obj_12)

       (pred_7 obj_16 obj_06)
       (pred_7 obj_16 obj_14)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_14 obj_17)
       (pred_7 obj_14 obj_16)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_17 obj_14)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_04)
       (pred_7 obj_06 obj_16)
       (pred_7 obj_04 obj_13)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_04 obj_06)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_13 obj_15)
       (pred_7 obj_13 obj_04)
       (pred_7 obj_13 obj_05)
       (pred_7 obj_15 obj_11)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_15 obj_13)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_01 obj_18)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_18 obj_01)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_11 obj_15)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_19 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_09)
       (pred_10  obj_04 obj_08)
       (pred_10  obj_09 obj_10)
       (pred_12 obj_16)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_01)
       (pred_12 obj_18)
       (pred_12 obj_11)
       (pred_12 obj_19)

       (pred_2  obj_07 obj_08)
       (pred_2  obj_12 obj_10)
       (pred_1 obj_07 obj_20)
       (pred_1 obj_12 obj_17)
       (pred_6 obj_20)
    )

    (:goal (and
       (pred_1 obj_12 obj_11)
    ))
(:constraints
  (always (not (pred_6 obj_09)))
)
)

; plan
1. (op_5 obj_20 obj_03)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_03)
   goals met: 0 of 1
2. (op_5 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_02)
   goals met: 0 of 1
3. (op_5 obj_02 obj_17)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_17)
   goals met: 0 of 1
4. (op_4 obj_17 obj_12)
   deleted: (pred_1 obj_12 obj_17) (pred_8)
   added: (pred_3 obj_12)
   goals met: 0 of 1
5. (op_5 obj_17 obj_02)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_02)
   goals met: 0 of 1
6. (op_5 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_03)
   goals met: 0 of 1
7. (op_5 obj_03 obj_20)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_20)
   goals met: 0 of 1
8. (op_5 obj_20 obj_15)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_15)
   goals met: 0 of 1
9. (op_5 obj_15 obj_11)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_11)
   goals met: 0 of 1
10. (op_2 obj_11 obj_12)
   deleted: (pred_3 obj_12)
   added: (pred_8) (pred_1 obj_12 obj_11)
   goals met: 1 of 1
